select brand, checked_at
from (
    select distinct on ( brand) brand , checked_at
from parts where type = 0 and flags & 1 = 1 
    order by brand, checked_at asc) as t 
order by checked_at;


COPY
(select *
from company_parts
order by id
) to '/home/qa2/tmp/ruipai_back/company_parts.csv'
with csv header


psql -h 192.168.10.160 -p 21770 -d goods_orders -U readonly -c "COPY (select *  from company_parts order by id) TO STDOUT with csv header" > /home/qa2/tmp/ruipai_back/company_parts.csv

COPY tanktab from '/u02/tank/123456.csv'
with csv header;

(values
('MA15688510221X11','MA15688510221X11','护盖 右侧，大灯清洗装置','前大灯喷水嘴盖（右）',0,'',0),
('MA15688510227787','MA15688510227787','护盖 右侧，大灯清洗装置','前大灯喷水嘴盖（右）',0,'',0),
('MA15688510229761','MA15688510229761','护盖 右侧，大灯清洗装置','前大灯喷水嘴盖（右）',0,'',0),
('MA15688542005896','MA15688542005896','环护盖 牵引钩','前保险杠拖车钩盖板',0,'',0),
('MA15688824009999','MA15688824009999','支架 底部','中网亮条（下）',0,'',0),
('MA15690561009107','MA15690561009107','开关组 上部操作面板','停车警告灯开关',0,'',0),
('MA15691020007N18','MA15691020007N18','驾驶员靠背罩 无','',0,'',0),
('MA15691021009J47','MA15691021009J47','驾驶员座垫 无','驾驶员座椅座垫总成',0,'',0),
('MA15691029008T79','MA15691029008T79','驾驶员座垫 无','驾驶员座椅座垫总成',0,'',0),
('MA15691075009K32','MA15691075009K32','驾驶员座垫 无','驾驶员座椅座垫总成',0,'',0),
('MA15692005011C82','MA15692005011C82','后排座椅靠背罩 左侧','',0,'',0),
('MA15692094009E43','MA15692094009E43','后排座椅靠背罩 右侧','',0,'',0),
('MA157221150026','MA157221150026','信息标签 空气污染控制装置','',0,'',0),
('MA157221240026','MA157221240026','信息标签 空气污染控制装置','',0,'',0),
('MA160096099980','MA160096099980','废气涡轮增压器 无','',0,'',0),
('MA1632670610648H72','MA1632670610648H72','手柄 无','',0,'进口奔驰ML级',0),
('MA16326706109B50','MA16326706109B50','手柄 无','',0,'进口奔驰ML级',0),
('MA17246062039F89','MA17246062039F89','辐式方向盘 无','',0,'',0),
('MA2045844181Z100','MA2045844181Z100','操作手册 无','',0,'',0),
('MA2045844181Z111','MA2045844181Z111','操作手册 无','',0,'',0),
('MA2045844182Z109','MA2045844182Z109','操作说明 COMAND（驾驶室管理及数据系统）','',0,'',0),
('MA2045844283Z122','MA2045844283Z122','操作手册 无','',0,'',0),
('MA2045844300Z105','MA2045844300Z105','操作手册 无','',0,'',0),
('MA2045844300Z112','MA2045844300Z112','操作手册 无','',0,'',0),
('MA2045844981Z104','MA2045844981Z104','操作手册','',0,'',0),
('MA17254002621148','MA17254002621148','开关组 左侧','',0,'',0),
('MA09976617009650','MA09976617009650','装饰环 左前车门','前门外拉手饰盖（左）',0,'',0),
('MA09976617009696','MA09976617009696','装饰环 左前车门','前门外拉手饰盖（左）',0,'',0),
('MA09976618006376','MA09976618006376','装饰环 右保护层','前门外拉手饰盖（右）',0,'',0),
('MA09976618008271','MA09976618008271','装饰环 右保护层','前门外拉手饰盖（右）',0,'',0),
('MA09976618008990','MA09976618008990','装饰环 右保护层','前门外拉手饰盖（右）',0,'',0),
('MA09976619002550','MA09976619002550','装饰环 左前车门','',0,'',0),
('MA09976619009296','MA09976619009296','装饰环 左前车门','',0,'',0),
('MA09976620007297','MA09976620007297','装饰环 右保护层','前门外拉手饰盖（右）',0,'',0),
('MA09981001138Q54','MA09981001138Q54','饮料架','',0,'',0),
('MA09981085009296','MA09981085009296','梅赛德斯三叉星徽 无','后徽标',0,'',0),
('MA09981100078N84','MA09981100078N84','护盖 左侧遮阳板支座','',0,'进口奔驰S级',0),
('MA17246079038R01','MA17246079038R01','方向盘 无','方向盘',0,'',0),
('MA09981101007297','MA09981101007297','后视镜壳 无','倒车镜壳（左）',0,'',0),
('MA09981101071B88','MA09981101071B88','轴承护盖 遮阳板，左侧','',0,'进口奔驰S级',0),
('MA09981101078T92','MA09981101078T92','轴承护盖 遮阳板，左侧','',0,'进口奔驰S级',0),
('MA09981101229775','MA09981101229775','后视镜壳 ','倒车镜壳（左）',0,'',0),
('MA09981102009296','MA09981102009296','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981102229149','MA09981102229149','后视镜壳 ','倒车镜壳（右）',0,'',0),
('MA09981102229775','MA09981102229775','后视镜壳 ','倒车镜壳（右）',0,'',0),
('MA09990527032A17','MA09990527032A17','开关板 左侧和右侧','',0,'',0),
('MA09990526039J32','MA09990526039J32','开关板 左侧和右侧','',0,'',0),
('MA09976617007795','MA09976617007795','装饰环 左前车门','前门外拉手饰盖（左）',0,'',0),
('MA09990521011B88','MA09990521011B88','开关组 左侧的翘板开关','',0,'',0),
('MA09990510032A17','MA09990510032A17','开关组 左侧的翘板开关','',0,'',0),
('MA0999050704052A17','MA0999050704052A17','开关板 左侧和右侧多功能开关','',0,'',0),
('MA09990507009X99','MA09990507009X99','开关组 右侧','',0,'',0),
('MA09990090009051','MA09990090009051','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09990084007H52','MA09990084007H52','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09990084001B88','MA09990084001B88','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09990023011B88','MA09990023011B88','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09990018017H52','MA09990018017H52','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09990015019051','MA09990015019051','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09990008011B88','MA09990008011B88','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09990003017H52','MA09990003017H52','控制单元 车顶上安装的工作单元','室内顶灯（前）',0,'',0),
('MA09986801899051','MA09986801899051','盲盖 中间衣帽架','',0,'',0),
('MA09981509399051','MA09981509399051','轴承座 遮阳板，左侧','',0,'',0),
('MA09981500919051','MA09981500919051','楔块 扶手，左侧','',0,'进口奔驰CLS级',0),
('MA09981500918L36','MA09981500918L36','楔块 扶手，左侧','',0,'进口奔驰CLS级',0),
('MA09981400018Q96','MA09981400018Q96','挂衣钩 左侧','',0,'',0),
('MA09981152009999','MA09981152009999','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981152007992','MA09981152007992','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981152005896','MA09981152005896','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981152000D02','MA09981152000D02','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981151009897','MA09981151009897','后视镜壳 无','倒车镜壳（左）',0,'',0),
('MA09981151009775','MA09981151009775','后视镜壳 无','倒车镜壳（左）',0,'',0),
('MA09981151008271','MA09981151008271','后视镜壳 无','倒车镜壳（左）',0,'',0),
('MA09981151003996','MA09981151003996','后视镜壳 无','倒车镜壳（左）',0,'',0),
('MA09981150009792','MA09981150009792','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981150003996','MA09981150003996','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981149008474','MA09981149008474','后视镜壳 无','倒车镜壳（左）',0,'',0),
('MA09981108229183','MA09981108229183','后视镜壳 右侧车外后视镜','倒车镜壳（右）',0,'',0),
('MA09981108226989','MA09981108226989','后视镜壳 右侧车外后视镜','倒车镜壳（右）',0,'',0),
('MA09981107227795','MA09981107227795','后视镜壳 左侧车外后视镜','倒车镜壳（左）',0,'',0),
('MA09981105071D11','MA09981105071D11','护盖 左侧附加遮阳板','',0,'',0),
('MA09981104225998','MA09981104225998','后视镜壳 ','倒车镜壳（右）',0,'',0),
('MA09981104009775','MA09981104009775','后视镜壳 无','倒车镜壳（右）',0,'',0),
('MA09981103229040','MA09981103229040','后视镜壳 ','倒车镜壳（左）',0,'',0),
('MA09981103005997','MA09981103005997','后视镜壳 无','倒车镜壳（左）',0,'',0),
('MA09981102229792','MA09981102229792','后视镜壳 ','倒车镜壳（右）',0,'',0),
('MA17254002627N10','MA17254002627N10','开关组 左侧','',0,'',0),
('MA17254002628P18','MA17254002628P18','开关组 左侧','',0,'',0),
('MA17254003628490','MA17254003628490','开关组 右侧','',0,'',0),
('MA1725840271Z108','MA1725840271Z108','简介','',0,'',0),
('MA1725840481Z102','MA1725840481Z102','操作手册','',0,'',0),
('MA1725840501Z110','MA1725840501Z110','操作手册 无','',0,'',0),
('MA1725840501Z125','MA1725840501Z125','操作手册 无','',0,'',0),
('MA1725840581Z103','MA1725840581Z103','操作说明','',0,'',0),
('MA1725840800Z103','MA1725840800Z103','操作手册 无','',0,'',0),
('MA1725840881Z110','MA1725840881Z110','操作手册','',0,'',0),
('MA1725841002Z100','MA1725841002Z100','操作手册 无','',0,'',0),
('MA1725841002Z119','MA1725841002Z119','操作手册 无','',0,'',0),
('MA1725841481Z117','MA1725841481Z117','操作说明 音频 20','',0,'',0),
('MA1725841600Z100','MA1725841600Z100','附加说明 音频 20','',0,'',0),
('MA1725841600Z107','MA1725841600Z107','附加说明 音频 20','',0,'',0))
    as tmp
(oe_code, std_oe_code, oe_name, std_name, price4s, veh_series, part_flags)




实际报错的sql：


update company_parts set
  std_oe_code = tmp.std_oe_code, std_name = tmp.std_name,
  oe_name = tmp.oe_name, veh_series = tmp.veh_series,
  price4s = tmp.price4s, updated_at = '2019-03-22T11:19:00+08:00', flags =
  case when ((flags >> 1) & 1) != tmp.part_flags & 1
  then (flags | 4) # 2
  else (flags | 4) end
  from (values
        ('MA16669034001C31', 'MA16669034001C31', '饰件 B 柱，右上', 'B柱上内饰板（右）', 0, '', 0),
        ('MA16669029258R86', 'MA16669029258R86', '饰件 B 柱，右上', 'B柱上内饰板（
右）', 0, '', 0),
        ('MA16669028509H93', 'MA16669028509H93', '车顶内衬 无', '车顶内衬', 0, '', 0),
        ('MA16669027501C31', 'MA16669027501C31', '车顶内衬 无', '车顶内衬', 0, '', 0),
        ('MA166690210
17L34', 'MA16669021017L34', '车顶内衬', '', 0, '', 0),
        ('MA16669020251C57', 'MA16669020251C57', '饰件 右侧 C 柱', 'C柱上内饰板（右）', 0, '', 0),
        ('MA16669018507L34', 'MA16669018507L34',
            '车顶内衬 无', '车顶内衬', 0, '', 0),
        ('MA16669018019H42', 'MA16669018019H42', '维修阀 左侧', '', 0, '', 0),
        ('MA16669018007M79', 'MA16669018007M79', '饰件 左侧，总成', '行李箱侧装饰板（
左）', 0, '', 0),
        ('MA16669017508R86', 'MA16669017508R86', '车顶内衬 无', '车顶内衬', 0, '', 0),
        ('MA16669017018T45', 'MA16669017018T45', '维修阀 右侧', '', 0, '', 0),
        ('MA16669016261B88', '
MA16669016261B88', '饰件 右侧 D 柱', 'D柱内饰板（右）', 0, '', 0),
        ('MA16669015267H52', 'MA16669015267H52', '饰件 左侧 D 柱', 'D柱内饰板（左）', 0, '', 0),
        ('MA16669013507L34', 'MA16669
013507L34', '车顶内衬 无', '车顶内衬', 0, '', 0),
        ('MA16669013251C57', 'MA16669013251C57', '饰件 A 柱，左上方', 'A柱上内饰板（左）', 0, '', 0),
        ('MA16669012018R00', 'MA16669012018R00', '
座椅扶手 左侧', '', 0, '', 0),
        ('MA16669010267N73', 'MA16669010267N73', '饰件 右侧 C 柱', 'C柱上内饰板（右）', 0, '', 0),
        ('MA16669006267J07', 'MA16669006267J07', '饰件 B 柱，底部右侧', 'B柱下内饰板（右）', 0, '', 0),
        ('MA16669002418Q91', 'MA16669002418Q91', '饰件 右侧', '行李箱侧装饰板（右）', 0, '', 0),
        ('MA16669002019H42', 'MA16669002019H42', '饰件 右侧', '行李箱侧
装饰板（右）', 0, '', 0),
        ('MA16669002018N84', 'MA16669002018N84', '饰件 右侧', '行李箱侧装饰板（右）', 0, '', 0),
        ('MA16669002008T45', 'MA16669002008T45', '饰件 右侧', '行李箱侧装饰板
（右）', 0, '', 0),
        ('MA16669000008Q91', 'MA16669000008Q91', '饰件 右侧', '行李箱侧装饰板（右）', 0, '', 0),
        ('MA16668420009051', 'MA16668420009051', '护边 后侧的承载底板', '', 0, '', 0),
        ('MA16668420007J07', 'MA16668420007J07', '护边 后侧的承载底板', '', 0, '', 0),
        ('MA16668400009051', 'MA16668400009051', '下部结构盖板 左侧的承载底板', '', 0, '', 0),
        ('MA124460630180', 'MA124460630180', '转向系 无', '', 0, '进口奔驰260 E|进口奔驰230 E|进口奔驰300 TD|进口奔驰300 TE|进口奔驰220 CE / E 220|进口奔驰300 E-24,  AMG 300 E 3.4|进口奔驰220 E / E 220|进口奔驰300 TE-24,AMG 300 TE 3.4|进口奔驰320 E / E 320|进口奔驰200 TE|进口奔驰200|进口奔驰300 E|进口奔驰300 D|进口奔驰250 D|进口奔驰320 TE / E 320 / E36 AMG|进口奔驰320 CE / E 320 / E36 AMG|进口奔驰220 TE / E 220|进口奔驰230 TE|进口奔驰280 E / E 280|进口奔驰280 TE / E 280|进口奔驰200 T|进口奔驰200 TE / E 200|进口奔驰200 E|进口奔驰E级|进口奔驰200 E / E 200|进口奔驰300 CE-24,AMG 300 CE 3.4', 0),
        ('MA124421161264', 'MA124421161264', '制动盘 ', '', 0, '进口奔驰260 E|进口奔驰230 E|进口奔驰300 TE|进口奔驰220 CE / E 220|进
口奔驰220 E / E 220|进口奔驰230 CE|进口奔驰500 SL|进口奔驰190 E 2.5-16|进口奔驰420 SL|进口奔驰300 E|进口奔驰250 D|进口奔驰220 TE / E 220|进口奔驰300 SL|进口奔驰230 TE|进口奔驰280 E / E 280|进口奔驰SL级|进口奔驰280 TE / E 280|进口奔驰190 E 2.3-16|进口奔驰300 CE|进口奔驰200 TE / E 200|进口奔驰E级|进口奔驰200 CE / E 200|进口奔驰200 E / E 200', 0),
        ('MA124401032606', 'MA124401032606', '环形弹簧 无', '', 0, '进口奔驰260 E|进口奔驰230 E|进口奔驰190 D 2.5 TURBODIESEL|进口奔驰190 D 2.5 AUSTRALIA|进口奔驰190 E 2.3 AUSTRALIA|进口奔驰190 E 1.8 AUSTRALIA|进口奔驰230 CE|进口奔驰250 TD|进口奔驰300 TD|进口奔驰300 TE|进口奔驰420 SEC|进口奔驰220 E / E 220|进口奔驰230 TE|进口奔驰300 D 4 MATIC|进口奔
驰500 SEC|进口奔驰220 CE / E 220|进口奔驰190 E 2.5-16|进口奔驰200|进口奔驰190 E 2.6 AUSTRALIA|进口奔驰300 SEL|进口奔驰200 CE ITALIEN|进口奔驰300 E  4 MATIC / E 300  4MATIC|进口奔驰300 D|进口奔驰250 D|进口奔驰200 TE|进口奔驰200 TD|进口奔驰300 TE 4 MATIC / E 300  4MATIC|进口奔驰300 E|进口奔驰190|进口奔驰220 TE / E 220|进口奔驰200 TE / E 200|
进口奔驰260 SE|进口奔驰280 E / E 280|进口奔驰300 SE|进口奔驰280 TE / E 280|进口奔驰190 E 2.3-16|进口奔驰200 T|进口奔驰260 E 4 MATIC|进口奔驰560 SE|进口奔驰300 CE|进口奔驰190 D|进口奔驰190 E AUSTRALIA|进口奔驰200 E|进口奔驰E级|进口奔驰200 CE / E 200|进口奔驰200 E / E 200', 0),
        ('MA124350621480', 'MA124350621480', '车轴外壳 后轴中间件', '后桥差速
器', 0, '进口奔驰300 TE|进口奔驰260 E', 0),
        ('MA124350509880', 'MA124350509880', '车轴外壳 无', '', 0, '进口奔驰E级', 0),
        ('MA124350231480', 'MA124350231480', '车轴外壳 无', '后桥差速器', 0, '进口奔驰250 D|进口奔驰200 E|进口奔驰200|进口奔驰E级|进口奔驰C级|进口奔驰200 CE ITALIEN', 0),
        ('MA124330090580', 'MA124330090580', '车轴外壳 无', '', 0, '进口奔驰300 D 4 MATIC', 0),
        ('MA124320927264', 'MA124320927264', '管路 高压管到连接接头', '', 0, '进口奔驰260 E|进口奔驰230 E|进口奔驰500 SL / AMG 500 SL 6.0 SL 500 / SL 600 AMG|进口奔驰300 E  4 MATIC / E 300  4MATIC|进口奔驰300 TD|进口奔驰300 TE|进口奔驰190 E 2.5-16            EVOLUTION|进口奔驰C级|进口奔驰300 D 4 MATIC|进口奔驰230 CE|进口奔驰200|进口奔驰500 SL / AMG 500 SL 6.0|进口奔驰300 E|进口奔驰300 D|进口奔驰250 D|进口奔驰200 TE|进口奔驰200 TD|进口奔驰300 TE 4 MATIC / E 300  4MATIC|进口奔驰600 SEL V12 / S 600|进口奔驰300 SL|进口奔驰CLK级|进口奔驰230 TE|进口奔驰300 SL-24|进口奔驰SL级|进口奔驰500 SEL / S 500|进口奔驰200 T|进口奔驰260 E 4 MATIC|进口奔驰300 CE|进口奔驰200 E|进口奔驰E级|进口奔驰250 TD', 0),
        ('MA124320377264', 'MA124320377264', '管路 无', '', 0, '进口奔驰260 E|进口奔驰300 CE-24|进口奔驰220 CE / E 220|进口奔驰300 E-24,  AMG 300 E 3.4|进口奔驰220 E / E 220|进口
奔驰300 TE-24,AMG 300 TE 3.4|进口奔驰300 D 4 MATIC|进口奔驰320 E / E 320|进口奔驰200 CE ITALIEN|进口奔驰300 E  4 MATIC / E 300  4MATIC|进口奔驰250 D|进口奔驰320 TE / E 320 / E36 AMG|进口奔驰320 CE / E 320 / E36 AMG|进口奔驰300 TE 4 MATIC / E 300  4MATIC|进口奔驰220 TE / E 220|进口奔驰280 E / E 280|进口奔驰280 TE / E 280|进口奔驰260 E 4 MATIC|进口奔驰200 TE / E 200|进口奔驰E级|进口奔驰200 CE / E 200|进口奔驰200 E / E 200|进口奔驰300 CE-24,AMG 300 CE 3.4', 0),
        ('MA124320377226', 'MA124320377226', '管路 无', '', 0, '
进口奔驰260 E|进口奔驰300 CE-24|进口奔驰220 CE / E 220|进口奔驰300 E-24,  AMG 300 E 3.4|进口奔驰220 E / E 220|进口奔驰300 TE-24,AMG 300 TE 3.4|进口奔驰300 D 4 MATIC|进口奔驰320 E / E 320|进口奔驰200 CE ITALIEN|进口奔驰300 E  4 MATIC / E 300  4MATIC|进口奔驰250 D|进口奔驰320 TE / E 320 / E36 AMG|进口奔驰320 CE / E 320 / E36 AMG|进口奔驰300 TE 4 MATIC / E 300  4MATIC|进口奔驰220 TE / E 220|进口奔驰280 E / E 280|进口奔驰280 TE / E 280|进口奔驰260 E 4 MATIC|进口奔驰200 TE / E 200|进口奔驰E级|进口奔驰200 CE / E 200|进口奔驰200 E / E 200|进口奔驰300 CE-24,AMG 300 CE 3.4', 0),
        ('MA124320304464', 'MA124320304464', '橡胶轴承 无', '', 0, '进口奔驰E级|进口奔驰200 CE / E 200|进口奔驰300 CE-24|
进口奔驰220 CE / E 220', 0),
        ('MA124320027264', 'MA124320027264', '管路 无', '', 0, '进口奔驰260 E|进口奔驰230 E|进口奔驰300 D|进口奔驰250 D|进口奔驰300 D 4 MATIC|进口奔驰300 E  4 MATIC / E 300  4MATIC|进口奔驰300 CE|进口奔驰230 CE|进口奔驰200|进口奔驰200 E|进口奔驰E级|进口奔驰300 E|进口奔驰260 E 4 MATIC', 0),
        ('MA124270940080', 'MA124270940080', '自
动变速箱 无', '变速器总成', 0, '', 0),
        ('MA124270900080', 'MA124270900080', '自动变速箱 无', '变速器总成', 0, '进口奔驰300 E|进口奔驰300 CE|进口奔驰190 D|进口奔驰190 E 2.6 AUSTRALIA|进口奔驰E级|进口奔驰C级|进口奔驰300 TE|进口奔驰420 SE', 0),
        ('MA124270790180', 'MA124270790180', '自动变速箱 无', '变速器总成', 0, '', 0),
        ('MA124270610180', 'MA124270610180', '自动变速箱 无', '变速器总成', 0, '进口奔驰E级', 0),
        ('MA124270580180', 'MA124270580180', '自动变速箱 无', '变速器总成', 0, '进口奔驰260 E 4 MATIC', 0),
        ('MA124270480080', 'MA124270480080', '自动变速箱 无', '变速器总成', 0, '', 0),
        ('MA124270230280', 'MA124270230280', '自动变速箱 无', '变速器总成', 0, '', 0),
        ('MA00091020049F26', 'MA00091020049F26', '驾驶员座椅 右侧', '', 0, '', 0),
        ('MA00091019047J70', 'MA00091019047J70', '驾驶员座椅 右侧', '', 0, '', 0),
        ('MA00091018188L25', 'MA00091018188L25', '盖板 电机', '', 0, '', 0),
        ('MA00091017047J70', 'MA00091017047J70', '驾驶员座椅 左侧', '', 0, '', 0),
        ('MA00091015089J55', 'MA00091015089J55', '衬垫 无', '', 0, '', 0),
        ('MA00091015027G84', 'MA00091015027G84', '驾驶员座垫 无', '驾驶员座椅座垫总成', 0, '', 0),
        ('MA00091011467E68', 'MA00091011467E68', '覆层 座垫', '', 0, '', 0),
        ('MA00091005799D73', 'MA00091005799D73', '座垫 整体式儿童座椅自动识别装置感压式安全垫', '', 0, '', 0),
        ('MA00091005027L24', 'MA00091005027L24', '驾驶员座椅 左侧', '', 0, '', 0),
        ('MA00091000048R83', 'MA00091000048R83', '头枕垫 无', '', 0, '', 0),
        ('MA00090695047H52', 'MA00090695047H52', '车内照明灯 车顶镶板里', '阅读灯', 0, '', 0),
        ('MA00090692051B88', 'MA00090692051B88', '车内照明灯 右后扶栏', '室内顶灯（前）', 0, '', 0),
        ('MA00090655001B88', 'MA00090655001B88', '车内照明灯 左后扶栏', '室内顶灯（前）', 0, '', 0),
        ('MA000906490328', 'MA000906490328', '车内照明灯', '', 0, '', 0),
        ('MA0009064101647H52', 'MA0009064101647H52', '行李箱灯 左侧 D 柱', '', 0, '', 0),
        ('MA00090637049051', 'MA00090637049051', '车内照明灯 手套箱照明', '杂物箱照明灯', 0, '', 0),
        ('MA000906270080', 'MA000906270080', '发电机 无', '发电机', 0, '进口奔驰224,209CDI,211CDI,213CDI,215CDI,218CDI|进口奔驰224, 209CDI, 211CDI, 215CDI, 218CDI|进口奔驰324,309CDI,311CDI,313CDI,315CDI,318CDI|进口奔驰V级|进口奔驰KASTENWAGEN|进口奔驰322, 309CDI, 311CDI, 315CDI, 316CDI|进口奔驰324, 309CDI, 311CDI, 315CDI, 318CDI|进口奔驰524, 509CDI, 511CDI, 515CDI, 518CDI', 0),
        ('MA00090615067H52', 'MA00090615067H52', '车内照明灯 左后扶栏', '室内灯', 0, '', 0),
        ('MA00090610351B88', 'MA00090610351B88', 'INTERIORLIGHT', '', 0, '', 0),
        ('MA000906050180', 'MA000906050180', '发电机 无', '发电机', 0, '进口奔驰C级', 0),
        ('MA000906022680', 'MA000906022680', '起动机 无', '起动机', 0, '进口奔驰V级|进口奔驰KASTENWAGEN', 0),
        ('MA000906020580', 'MA000906020580', '三相交流发电机 无', '发电机', 0, '进口奔驰E级|北京奔驰E级', 0),
        ('MA00090593009792', 'MA00090593009792', '车距传感器 驻车定位系统，后部', '后保险杠电眼', 0, '', 0),
        ('MA00090593002550', 'MA00090593002550', '车距传感器 驻车定位系统，后部', '后保险杠电眼', 0, '', 0),
        ('MA000905780306', 'MA000905780306', 'NOX - 传感器 无', '氧传感器（后）', 0, '', 0),
        ('MA000905570106', 'MA000905570106', '雷达传感器 限距控制系统(DTR)', '巡航传感器', 0, '进口奔驰ML/GLE级|进口奔驰CLS级|进口奔驰SLK级|进口奔驰GLK级|进口奔驰CL级|进口奔驰GL/GLS级|进口奔驰ML级|进口奔驰C级|进口奔驰GL级|进口奔驰SL级', 0),
        ('MA00090556049149', 'MA00090556049149', '车距传感器 左外侧和右外侧', '前保险杠电眼', 0, '福建奔驰V级|进口奔驰G级', 0),
        ('MA00090556049040', 'MA00090556049040', '车距传感器 左外侧和右外侧', '前保险杠电眼', 0, '福建奔驰V级|进口奔驰G级', 0),
        ('MA00090555040D04', 'MA00090555040D04', '车距传感器 驻车定位系统，到保险杠上部', '', 0, '福建奔驰V级|进口奔驰G级', 0),
        ('MA00090555040052', 'MA00090555040052', '车距传感器 驻车定位系统，到保险杠上部', '', 0, '福建奔驰V级|进口奔驰G级', 0),
        ('MA000905470428', 'MA000905470428', 'NOX - 传感器 催化转化器上游', '', 0, '', 0),
        ('MA00090512029963', 'MA00090512029963', '车距传感器 左外侧和右外侧', '前保险杠电眼', 0, '', 0),
        ('MA00090512029186', 'MA00090512029186', '车距传感器 左外侧和右外侧', '前保险杠电眼', 0, '', 0),
        ('MA00090512027G99', 'MA00090512027G99', '车距传感器 左外侧和右外侧', '前保险杠电眼', 0, '', 0),
        ('MA00090512025894', 'MA00090512025894', '车距传感器 左外侧和右外侧', '前保险杠
电眼', 0, '', 0),
        ('MA00090502427297', 'MA00090502427297', '传感器', '', 0, '', 0),
        ('MA00090502423996', 'MA00090502423996', '传感器', '', 0, '', 0),
        ('MA00090098067H52', 'MA00090098067H52', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090096061B88', 'MA00090096061B88', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090095069051', 'MA00090095069051', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090094067H52', 'MA00090094067H52', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090094039051', 'MA00090094039051', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090091071B88', 'MA00090091071B88', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090090071B88', 'MA00090090071B88', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090087067H52', 'MA00090087067H52', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090086061B88', 'MA00090086061B88', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090084079051', 'MA00090084079051', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA00090082079051', 'MA00090082079051', '控制单元 车顶上安装的工作单元', '室内顶灯（前）', 0, '', 0),
        ('MA90668403827K26', 'MA90668403827K26', '地板 无', '', 0, '', 0),
        ('MA90668000318J06', 'MA90668000318J06', '托架', '', 0, '', 0),
        ('MA90663700157390', 'MA90663700157390', '加强件 镶板', '', 0, '进口奔驰324, 309CDI, 311CDI, 315CDI, 318CDI', 0),
        ('MA90661026257390', 'MA90661026257390', '加强件', '', 0, '', 0),
        ('MA463401060091', 'MA463401060091', '辐板式车轮 后轴', '后钢圈', 0, '进
口奔驰G级', 0),
        ('MA463280140080', 'MA463280140080', '分动箱 无', '分动器', 0, '', 0),
        ('MA46327400279D06', 'MA46327400279D06', '换档杆 无', '', 0, '', 0))
    as tmp (oe_code, std_oe_code, oe_name, std_name, price4s, veh_series, part_flags)

  where company_parts.oe_code = tmp.oe_code and veh_brand='北京奔驰';